"""ΘΕΜΑ Γ
Μια εταιρεία απασχολεί 50 υπαλλήλους. Οι μηνιαίες αποδοχές κάθε υπαλλήλου κυμαίνονται από 
800 έως και 2000 ευρώ. Να γράψετε πρόγραμμα σε Python το οποίο:
Γ1. Για κάθε υπάλληλο που απασχολείται στην εταιρεία:
α. Διαβάζει με τη βοήθεια κατάλληλου μηνύματος το ονοματεπώνυμο του. (μον. 2)
β. Διαβάζει με τη βοήθεια κατάλληλου μηνύματος ως πραγματικό αριθμό τις μηνιαίες 
αποδοχές του υπαλλήλου. Σε περίπτωση όπου δοθεί μη έγκυρη τιμή για τις αποδοχές 
το πρόγραμμα να εμφανίζει το μήνυμα «Λάθος τιμή για τις αποδοχές. Προσπαθήστε 
ξανά» και να δίνει τη δυνατότητα στο χρήστη να εισάγει ξανά νέα τιμή για τις αποδοχές 
μέχρι αυτή να είναι αποδεκτή με τις προδιαγραφές του προβλήματος. (μον. 3) 
γ. Καλεί τη συνάρτηση με όνομα taxis η οποία δέχεται σαν παράμετρο τις μηνιαίες 
αποδοχές του υπαλλήλου. (μον.2) 
δ. Να εμφανίζει το ονοματεπώνυμο, τις μηνιαίες αποδοχές, το φόρο και τις καθαρές 
μηνιαίες αποδοχές που προκύπτουν μετά την αφαίρεση του φόρου. (μον. 4).
Μονάδες 11
Γ2. Στο τέλος το πρόγραμμα να εμφανίζει με τη βοήθεια κατάλληλων μηνυμάτων:
α. Τη μέση τιμή του φόρου που αντιστοιχεί σε όλους τους υπαλλήλους. (μον. 2).
β. Το συνολικό ποσό που αντιστοιχεί στις καθαρές μηνιαίες αποδοχές όλων των 
υπαλλήλων. (μον. 2)
Μονάδες 4
Γ3. Να κατασκευάσετε την συνάρτηση taxis του ερωτήματος Γ1.γ λαμβάνοντας υπόψη ότι η 
συνάρτηση υπολογίζει και επιστρέφει το ποσό του φόρου που αντιστοιχεί σε κάθε υπάλληλο 
κλιμακωτά σύμφωνα με τον παρακάτω πίνακα:
Μηνιαίες αποδοχές (σε ευρώ)      Ποσοστό κράτησης φόρου (επί των  μηνιαίων αποδοχών)
Από 800 έως και 1000                 15%
Άνω των 1000 έως και 1400            22%
Άνω των 1400                         35%
"""

def taxis(mhn):
    if mhn >= 800 and mhn <= 1000:
        foros = mhn*15/100.0
    elif mhn <= 1400:
        foros = 1000*15/100.0 + (mhn - 1000)*22/100.0
    else:
        foros = 1000*15/100.0 + 400*22/100.0 + (mhn - 1400)*35/100.0
    return foros

sun_foros = 0
sun_kath = 0
for i in range(50):
    onom = raw_input ('dose on:')
    mhn = float(input('dose apodoxes:'))
    while mhn < 800 or mhn > 2000:
        mhn = float(input('Lathos. Ksanadwse:'))
    foros = taxis(mhn)
    sun_foros += foros
    kath = mhn - foros
    sun_kath += kath
    print onom, mhn, foros, kath
print sun_foros/50.0
print sun_kath
