"""
13.	Μία εταιρεία ενοικίασης αυτοκινήτων έχει νοικιάσει 30 αυτοκίνητα τα οποία κατηγοριοποιούνται 
σε οικολογικά και συμβατικά. Η πολιτική χρέωσης για την ενοικίαση ανά κατηγορία και ανά ημέρα δίνεται 
στον παρακάτω πίνακα.
ΗΜΕΡΕΣ	           ΟΙΚΟΛΟΓΙΚΑ	       ΣΥΜΒΑΤΙΚΑ
1-7	                 30€ ανά ημέρα	    40€ ανά ημέρα
8-16	             20€ ανά ημέρα	    30€ ανά ημέρα
από 17 και άνω  	 10€ ανά ημέρα	    20€ ανά ημέρα
1. Να αναπτύξετε πρόγραμμα το οποίο:
α. Για κάθε αυτοκίνητο το οποίο έχει ενοικιαστεί:
i.	∆ιαβάζει την κατηγορία του («ΟΙΚΟΛΟΓΙΚΑ» ή «ΣΥΜΒΑΤΙΚΑ») και τις ημέρες ενοικίασης.
ii. Καλεί συνάρτηση με είσοδο την κατηγορία του αυτοκινήτου και τις ημέρες ενοικίασης 
και υπολογίζει με βάση τον παραπάνω πίνακα τη χρέωση.
iii. Εμφανίζει το μήνυμα “χρέωση” και τη χρέωση που υπολογίσατε.
 γ. Υπολογίζει και εμφανίζει το πλήθος των οικολογικών και των συμβατικών αυτοκινήτων.
2. Να κατασκευάσετε τη συνάρτηση του ερωτήματος 1.α.ii .
"""

# -*- coding: utf-8 -*-
def sinart(katig,meres_e):
    oikol=0
    simba=0
    while katig!="οικολογικο" and katig!="συμαβτικο":
        if katig=="οικολογικο" and meres_e<=7 and meres_e>=1:
            plerosi=meres_e*30.0
            oikol+=1
        elif katig=="οικολογικο" and meres_e>=8 and meres_e<=16:
            plerosi=meres_e*20.0
            oikol+=1
        elif katig=="οικολογικο" and meres_e>=17 :
            plerosi=meres_e*10.0
            oikol+=1
        elif katig=="συμβατικο" and meres_e<=7 and meres_e>=1:
            plerosi=meres_e*40.0
            simba+=1
        elif katig=="συμβατικο" and meres_e>=8 and meres_e<=16:
            plerosi=meres_e*30.0
            simba+=1
        elif katig=="συμβατικο" and meres_e>=17:
            plerosi=meres_e*20.0
            simba+=1
        print plerosi , " θα πληρώσεις με" , katig , "και με " , meres_e , "μερες ενοικίασεις"
        katig=raw_input("οικολογικο ή συμβατικο ; ")
        meres_e=input("πόσες μερες το θες το οχημα ; ")
    print oikol ,'οικολογικα πουλήθηκαν'
    print simba,'συμβατικα πουλήθηκαν'
katigoria=raw_input("οικολογικο ή συμβατικο ; ")
meres=input("πόσες μερες το θες το οχημα ; ")
for i in range(30):
    sinart(katigoria,meres)