"""
17.	Μία εταιρεία μεταφοράς δεμάτων διαθέτει δύο αποθήκες, Α και Β, στο αεροδρόμιο. 
Κατά την παραλαβή δεμάτων, κάθε δέμα τοποθετείται στην αποθήκη που έχει εκείνη τη 
στιγμή τον περισσότερο ελεύθερο χώρο. Αν ο ελεύθερος χώρος της αποθήκης Α είναι ίσος 
με τον ελεύθερο χώρο της αποθήκης Β, το δέμα τοποθετείται στην αποθήκη Α. Όταν όμως 
το δέμα δεν χωρά σε καμία από τις δύο αποθήκες, προωθείται στις κεντρικές εγκαταστάσεις 
της εταιρείας, που βρίσκονται εκτός αεροδρομίου.
1. Να κατασκευάσετε πρόγραμμα που:
α. Να διαβάζει τα μεγέθη ελεύθερου χώρου των αποθηκών Α και Β . 
β. Να διαβάζει το μέγεθος κάθε εισερχόμενου δέματος και να εμφανίζει το όνομα της 
αποθήκης (Α ή Β) στην οποία θα τοποθετηθεί αυτό ή να εμφανίζει το μήνυμα «Προώθηση», 
όταν το δέμα δεν χωρά σε καμία από τις αποθήκες Α ή Β. Η διαδικασία παραλαβής τερματίζεται, 
όταν εισαχθεί ως μέγεθος δέματος η τιμή 0.
γ. Στη συνέχεια, να καλεί συνάρτηση, η οποία να βρίσκει και να εμφανίζει το όνομα της 
αποθήκης (Α ή Β) στην οποία τοποθετήθηκαν τα περισσότερα δέματα, ή το μήνυμα «Ισάριθμα» 
σε περίπτωση που στις δύο αποθήκες Α και Β τοποθετήθηκαν ισάριθμα δέματα, ή το μήνυμα 
«Καμία αποθήκευση στο αεροδρόμιο», αν κανένα δέμα δεν τοποθετήθηκε σε οποιαδήποτε από τις αποθήκες Α ή Β. 
2. Να κατασκευάσετε το υποπρόγραμμα που περιγράφεται στο ερώτημα 1.γ
"""
# -*- coding: utf-8 -*-
def sinart(pla,plb):
    if pla>plb:
        print 'a εχει περισοοτερα πακετα'
    elif plb>pla:
        print 'b εχει περισοοτερα πακετα'
    elif pla==0 and plb==0:
        print '«Καμία αποθήκευση στο αεροδρόμιο»'
    elif pla==plb:
        print '«Ισάριθμα»'
apoth_a=0
apoth_b=0
a=input('xoro a; ')
b=input('xoro b;')
dema=input('poso;')
while dema!=0:
    if dema<=a:
        if a>=b:
            a=a-dema
            print 'a'
            apoth_a=apoth_a+1
        elif b>a:
            b=b-dema 
            print 'b'
            apoth_b=apoth_b+1
    elif dema<=b:
        if b>a:
            b=b-dema
            print 'b'
            apoth_b=apoth_b+1
    else:
        print '«Προώθηση»'
    dema=input('poso;')
sinart(apoth_a,apoth_b)