"""
Να γράψετε ένα πρόγραµµα σε Python το οποίο για κάθε µαθητή
που δίνει πανελλήνιες εξετάσεις θα: 
∆1. ∆ιαβάζει το όνοµα, τον τελικό βαθµό και την πόλη και θα
αποθηκεύει τα δεδοµένα στις λίστες name, grade, city. 

∆2. σταµατάει η είσοδος των δεδοµένων όταν δοθεί αντί για όνοµα
το γράµµα “Τ” 

∆3. εµφανίζει το µέσο όρο των µαθητών από τα Ιωάννινα

∆4. εµφανίζει τα ονόµατα των µαθητών που έχουν βαθµό
µεγαλύτερο από τον παραπάνω µέσο όρο. 
"""

# -*- coding: utf-8 -*-
counter=0
for i in range(10):
    e=input("αριθμό επικινδυνότητας")
    if e==0:
        print "λευκό , κανένας κίνδυνος"
        counter+=1
    elif e==1:
        print "πράσινο, σύνηθες επίπεδο"
    elif e>=2 and e<=4:
        print "κίτρινο, αστονομικού ενδιαφέροντος"
    elif e>=5 and e<=7:
        print "πορτοκλαι, εν δυνάμει απειλη"
    elif e>=8 and e<=10:
        print "κόκκινο,  βέβαιη Σύγκουσή"
        print "κίνδυνος σύγκουσης"
print counter, "λευκα , κανένας κίνδυνος"
