"""
14.	Σε ένα παρκινγκ η χρέωση γίνεται κλιμακωτά, όπως φαίνεται στον παρακάτω πίνακα: 
ΔΙΑΡΚΕΙΑ ΣΤΑΘΜΕΥΣΗΣ     	ΚΟΣΤΟΣ ΑΝΑ ΩΡΑ
Μέχρι και 3 ώρες 	             2 €
Πάνω από 3 έως και 5 ώρες	    1,5 €
Πάνω από 5 ώρες 	            1,3 €

Ι. Να κατασκευάσετε πρόγραμμα το οποίο: 
α) για κάθε αυτοκίνητο που στάθμευσε στο παρκινγκ: 
i. διαβάζει τον αριθμό κυκλοφορίας μέχρι να δοθεί το 0. Να θεωρήσετε ότι ο αριθμός κυκλοφορίας μπορεί να περιέχει τόσο γράμματα όσο και αριθμούς.
ii. διαβάζει τη διάρκεια στάθμευσης σε ώρες και τη δέχεται μόνο εφ’ όσον είναι μεγαλύτερη από το 0. 
iii. καλεί συνάρτηση για τον υπολογισμό του ποσού που πρέπει να πληρώσει ο κάτοχός του.
iv. εμφανίζει τον αριθμό κυκλοφορίας και το ποσό που αναλογεί. 
γ) εμφανίζει το πλήθος των αυτοκινήτων που έμειναν στο παρκινγκ μέχρι και δύο ώρες.
ΙΙ. Να κατασκευάσετε τη συνάρτηση που καλείται στο ερώτημα α) iii.

"""
# -*- coding: utf-8 -*-
def ipologismos(pinakida,diarkia):
    if diarkia<=3:
        print pinakida , diarkia*2
    elif diarkia>3 and  diarkia<=5:
        print pinakida ,(3*2)+((diarkia-3)*1.5)
    else:	
        print pinakida ,(3*2)+(2*1.5)+((diarkia-5)*1.3)
pl_2=0
pinakida=raw_input("δωσε αριθμο πινακιδας: ")
while pinakida!='0':
    diarkia=input('poso ekatsew: ')
    while diarkeia <= 0:
        diarkia=input('poso ekatsew: ')
    ipologismos(pinakida,diarkia)
    if diarkia<=2:
        pl_2+=1
    pinakida=raw_input("δωσε αριθμο πινακιδας: ")
print pl_2 , ' atoma εκατσαν εως και 2 ωρες'
