"""
15.	Το κλασικό παιχνίδι «Πέτρα – Ψαλίδι - Χαρτί» παίζεται με δύο παίκτες. 
Σε κάθε γύρο του παιχνιδιού, ο κάθε παίκτης επιλέγει ένα από τα ΠΕΤΡΑ, ΨΑΛΙ∆Ι, ΧΑΡΤΙ,
 και παρουσιάζει την επιλογή του ταυτόχρονα με τον αντίπαλό του. Η ΠΕΤΡΑ κερδίζει 
 το ΨΑΛΙ∆Ι, το ΨΑΛΙ∆Ι το ΧΑΡΤΙ και το ΧΑΡΤΙ την ΠΕΤΡΑ. Σε περίπτωση που οι δύο παίκτες 
 έχουν την ίδια επιλογή, ο γύρος λήγει ισόπαλος. Το παιχνίδι προχωράει με συνεχόμενους 
 γύρους μέχρι ένας τουλάχιστον από τους παίκτες να αποχωρήσει. Νικητής αναδεικνύεται ο 
 παίκτης με τις περισσότερες νίκες. Αν οι δύο παίκτες έχουν τον ίδιο αριθμό νικών, το 
 παιχνίδι λήγει ισόπαλο.  
Να αναπτύξετε πρόγραμμα το οποίος διαβάζει τα ονόματα των δύο παικτών και υλοποιεί το 
παραπάνω παιχνίδι ως εξής: 
Α. Για κάθε γύρο του παιχνιδιού: 
1. διαβάζει την επιλογή κάθε παίκτη, η οποία μπορεί να είναι μία από τις εξής: 
ΠΕΤΡΑ, ΨΑΛΙ∆Ι, ΧΑΡΤΙ, ΤΕΛΟΣ. (Δεν απαιτείται έλεγχος εγκυρότητας τιμών.) 
2. συγκρίνει τις επιλογές των παικτών και διαπιστώνει το νικητή του γύρου ή την ισοπαλία. 
Β. Τερματίζει το παιχνίδι όταν ένας τουλάχιστον από τους δύο παίκτες επιλέξει ΤΕΛΟΣ. 
Γ. Εμφανίζει το όνομα του νικητή ή, αν δεν υπάρχει νικητής, το μήνυμα «ΤΟ ΠΑΙΧΝΙ∆Ι ΕΛΗΞΕ ΙΣΟΠΑΛΟ». 
"""

# -*- coding: utf-8 -*-
a=raw_input('δωσε α: ')
b=raw_input('δωσε β: ')
ap=0
bp=0
while a!='ΤΕΛΟΣ' and b!='ΤΕΛΟΣ':
    if a=='ΠΕΤΡΑ' and b=='ΠΕΤΡΑ':
        print 'ισοπαλία'
    elif a=='ΨΑΛΙ∆Ι' and b=='ΨΑΛΙ∆Ι':
        print 'ισοπαλία'
    elif a=='ΧΑΡΤΙ' and b=='ΧΑΡΤΙ':
        print 'ισοπαλία'
    elif a=='ΠΕΤΡΑ' and b=='ΨΑΛΙ∆Ι':
        print 'o a kerdise'
        ap+=1
    elif a=='ΨΑΛΙ∆Ι' and b=='ΧΑΡΤΙ':
        print 'o a kerdise'
        ap+=1
    elif a=='ΧΑΡΤΙ' and b=='ΠΕΤΡΑ':
        print 'o a kerdise'
        ap+=1
    elif b=='ΠΕΤΡΑ' and a=='ΨΑΛΙ∆Ι':
        print 'o b kerdise'
        bp+=1
    elif b=='ΧΑΡΤΙ' and a=='ΠΕΤΡΑ':
        print 'o b kerdise'
        bp+=1
    elif b=='ΨΑΛΙ∆Ι' and a=='ΧΑΡΤΙ':
        print 'o b kerdise'
        bp+=1
    a=raw_input('δωσε α: ')
    b=raw_input('δωσε β: ')
if ap==bp:
    print '«ΤΟ ΠΑΙΧΝΙ∆Ι ΕΛΗΞΕ ΙΣΟΠΑΛΟ»'
elif ap>bp:
    print  'νικητης ο α'
else:
    print 'βαθμοι του β'
